<?php

return [
    'admin' => [
        'listing' => [
            'new' => [
                'title' => 'تم إنشاء إعلان جديد',
                'body' => 'تم إنشاء إعلان جديد بواسطة :user_name برقم :listing_id',
            ],

            'updated' => [
                'title' => 'تم تحديث إعلان',
                'body' => 'تم تحديث إعلان برقم :listing_id بواسطة :user_name، يرجى مراجعة التعديلات',
            ],

        ],

        'listing_review' => [
            'new' => [
                'title' => 'تم إنشاء تقييم جديد',
                'body' => 'تم إنشاء تقييم جديد بواسطة :user_name للإعلان رقم :listing_id بتقييم :rating، يرجى المراجعة',
            ],
        ],
    ],

    'user' => [
        'listing' => [
            'status_changed' => [
                'draft' => [
                    'title' => 'تم تحويل إعلانك إلى مسودة',
                    'body' => 'تم تحويل إعلانك رقم :listing_id إلى مسودة من قبل الإدارة',
                ],
                'in_review' => [
                    'title' => 'إعلانك قيد المراجعة',
                    'body' => 'إعلانك رقم :listing_id الآن قيد المراجعة من قبل فريقنا، سنعلمك بالنتيجة قريباً',
                ],
                'approved' => [
                    'title' => '🎉 مبروك! تم اعتماد إعلانك',
                    'body' => 'تم اعتماد إعلانك رقم :listing_id وأصبح مرئياً للجميع الآن',
                ],
                'rejected' => [
                    'title' => 'تم رفض إعلانك',
                    'body' => 'نأسف لإبلاغك بأن إعلانك رقم :listing_id لم يتم قبوله، يرجى مراجعة الملاحظات وإعادة المحاولة',
                ],
            ],

            'deleted' => [
                'title' => 'تم حذف إعلانك',
                'body' => 'تم حذف إعلانك رقم :listing_id بواسطة الإدارة',
            ],
        ],


        'listing_review' => [
            'approved' => [
                'title' => 'تم اعتماد تقييمك',
                'body' => 'تم اعتماد تقييمك رقم :listing_review_id للإعلان رقم :listing_id بتقييم :rating، وأصبح مرئياً للجميع الآن',
            ],
            'cancelled' => [
                'title' => 'تم إلغاء تقييمك',
                'body' => 'تم إلغاء تقييمك رقم :listing_review_id للإعلان رقم :listing_id بواسطة الإدارة.',
            ],
        ],

        'session' => [
            'expired' => [
                'title' => 'تم انتهاء جلستك',
                'body' => 'تم انتهاء جلستك، يرجى تسجيل الدخول مرة أخرى.',
            ],
        ],
    ],
];
